Ran Plan for 3 projects:

1. project: `fileflow-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
1. project: `fileflow-ecs-scheduler-prod` dir: `terraform/ecs-scheduler` workspace: `default`
1. project: `fileflow-ecs-download-worker-prod` dir: `terraform/ecs-download-worker` workspace: `default`
---

### 1. project: `fileflow-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 init -input=false" in "/home/atlantis/.atlantis/repos/ryu-qqq/FileFlow/105/default/terraform/ecs-web-api": exit status 1

Initializing the backend...
Initializing modules...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for adot_sidecar...
- adot_sidecar in .terraform/modules/adot_sidecar/terraform/modules/adot-sidecar
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for ecs_security_group...
- ecs_security_group in .terraform/modules/ecs_security_group/terraform/modules/security-group
- ecs_security_group.tags in .terraform/modules/ecs_security_group/terraform/modules/common-tags
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for ecs_service...
- ecs_service in .terraform/modules/ecs_service/terraform/modules/ecs-service
- ecs_service.tags in .terraform/modules/ecs_service/terraform/modules/common-tags
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for web_api_logs...
- web_api_logs in .terraform/modules/web_api_logs/terraform/modules/cloudwatch-log-group
- web_api_logs.tags in .terraform/modules/web_api_logs/terraform/modules/common-tags
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for web_api_task_execution_role...
- web_api_task_execution_role in .terraform/modules/web_api_task_execution_role/terraform/modules/iam-role-policy
- web_api_task_execution_role.tags in .terraform/modules/web_api_task_execution_role/terraform/modules/common-tags
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for web_api_task_role...
- web_api_task_role in .terraform/modules/web_api_task_role/terraform/modules/iam-role-policy
- web_api_task_role.tags in .terraform/modules/web_api_task_role/terraform/modules/common-tags
╷
│ Error: Backend configuration changed
│ 
│ A change in the backend configuration has been detected, which may require
│ migrating existing state.
│ 
│ If you wish to attempt automatic migration of the state, use "terraform
│ init -migrate-state".
│ If you wish to store the current configuration with no changes to the
│ state, use "terraform init -reconfigure".
╵


```
</details>

---
### 2. project: `fileflow-ecs-scheduler-prod` dir: `terraform/ecs-scheduler` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 init -input=false" in "/home/atlantis/.atlantis/repos/ryu-qqq/FileFlow/105/default/terraform/ecs-scheduler": exit status 1

Initializing the backend...
Initializing modules...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for adot_sidecar...
- adot_sidecar in .terraform/modules/adot_sidecar/terraform/modules/adot-sidecar
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for ecs_security_group...
- ecs_security_group in .terraform/modules/ecs_security_group/terraform/modules/security-group
- ecs_security_group.tags in .terraform/modules/ecs_security_group/terraform/modules/common-tags
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for scheduler_logs...
- scheduler_logs in .terraform/modules/scheduler_logs/terraform/modules/cloudwatch-log-group
- scheduler_logs.tags in .terraform/modules/scheduler_logs/terraform/modules/common-tags
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for scheduler_service...
- scheduler_service in .terraform/modules/scheduler_service/terraform/modules/ecs-service
- scheduler_service.tags in .terraform/modules/scheduler_service/terraform/modules/common-tags
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for scheduler_task_execution_role...
- scheduler_task_execution_role in .terraform/modules/scheduler_task_execution_role/terraform/modules/iam-role-policy
- scheduler_task_execution_role.tags in .terraform/modules/scheduler_task_execution_role/terraform/modules/common-tags
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for scheduler_task_role...
- scheduler_task_role in .terraform/modules/scheduler_task_role/terraform/modules/iam-role-policy
- scheduler_task_role.tags in .terraform/modules/scheduler_task_role/terraform/modules/common-tags
╷
│ Error: Backend configuration changed
│ 
│ A change in the backend configuration has been detected, which may require
│ migrating existing state.
│ 
│ If you wish to attempt automatic migration of the state, use "terraform
│ init -migrate-state".
│ If you wish to store the current configuration with no changes to the
│ state, use "terraform init -reconfigure".
╵


```
</details>

---
### 3. project: `fileflow-ecs-download-worker-prod` dir: `terraform/ecs-download-worker` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.download_worker_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/fileflow-cluster-prod/fileflow-download-worker-prod"
        name                               = "fileflow-download-worker-prod"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for fileflow-download-worker-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "fileflow-download-worker-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "fileflow"
            "Service"     = "fileflow-download-worker"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/fileflow-download-worker-prod:36" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.download_worker_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/fileflow-download-worker-prod:36" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/fileflow-download-worker-prod" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "fileflow-download-worker-prod" -> (known after apply)
      ~ revision                 = 36 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for fileflow-download-worker-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "fileflow-download-worker-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "fileflow"
            "Service"     = "fileflow-download-worker"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/fileflow-download-worker-prod:36" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p fileflow-ecs-download-worker-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FFileFlow%252Fterraform%252Fecs-download-worker%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p fileflow-ecs-download-worker-prod
  ```
Plan: 1 to add, 1 to change, 1 to destroy.

---
### Plan Summary

3 projects, 1 with changes, 0 with no changes, 2 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```